vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.TLE988x_9x_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Infineon</vendor>
  <name>TLE988x_9x_DFP</name>
  <description>Infineon TLE988x/TLE989x Series Device Support</description>
  <url>https://itools.infineon.com/cmsis_packs/TLE988x_9x/</url>
  <supportContact>http://www.infineon.com/cms/en/corporate/company/contact/support/index.html</supportContact>
  <license>license/IFX_SW_Licence_MOTIX_LITIX.txt</license>
  <releases>
    <release version="1.3.0" date="2024-12-20">
      Examples: Added ADC1 GPT12 example [EP-1273]
      Examples: Fixed NVM_PROG_UCODE_EXAMPLE_TLE989x example [EP-1546]
      Config Wizard: Fixed typo in SSC timing [EP-1541]
      Config Wizard: Corrected mapping of P2.8, P2.8, P2.9 in CCU7 [EP-1558]
      BDRV: Corrected min VCP voltage definition [EP-1543]
      Interrupts: Removed *_FILL_INT_OVERVIEW defines from isr_defines.h [EP-1545]
      Interrupts: Added initialization of SHPR1 and SHPR3 with values from Config Wizard [EP-1531]
      Updated datasheet [EP-1554]
      Updated license in driver files [EP-1494]
	</release>
    <release version="1.2.0" date="2024-06-19">
      Config Wizard: Added support for KBA viewer [EP-1524]
      Disabled warning 'unsafe buffer access' in Keil uVision examples [EP-1480]
      Added svd file for 2 phase variant (TLE988x) [EP-1518]
      Added unused memory areas to IAR linker script for consistency [EP-1449]
      Corrected DSRAM size in TLE9881/TLE9891 ARM linker file [EP-1530]
      ADC, BDRV, CCU: Added several new functions [EP-1488]
      ADC1: Removed connection ADC1/VDDEXT in Config Wizard [EP-1529]
      Startup: Corrected UC_FLASH0_UBSL_SIZE calculation [EP-1481]
      Startup: Removed outdated comments from startup file [EP-1510]
      Note: The Keil uVision examples need at least ARM Compiler for Embedded v6.21
    </release>
    <release version="1.1.0" date="2023-12-13">
      CCU7: Corrected CCPOS0A mapping in Config Wizard [EP-1454]
      CSACSC: Fixed formula for CSACSC.CTRL2.THR_SEL [EP-1469]
      GPIO: Added GPIO names and locks to EXTINT section [EP-1452]
      Startup: Corrected linker file (NVM1 not available) [EP-1461]
      Startup: Improved debug handling (startup file) [EP-1464]
      Startup: Applied Cache Enable from CW [EP-1465]
      UART: Added initialization of UARTx.LINCON register [EP-1448]
      Corrected tle_device.c when using a device without SDADC [EP-1471]
      Added MOTIX series to svd file [EP-1459]
      Known issue: Warning 'unsafe buffer access' with Arm Compiler for Embedded 6.21
    </release>
    <release version="1.0.0" date="2023-06-14">
      Initial release of TLE988x/9x Device Family Pack for Keil uVision and IAR Embedded Workbench for ARM (version 9.40.1 and newer)
    </release>
  </releases>
  <keywords>
    <keyword>Infineon</keyword>
    <keyword>TLE988x</keyword>
    <keyword>TLE989x</keyword>
    <keyword>Embedded Power</keyword>
  </keywords>
  <devices>
    <family Dfamily="TLE98xx Series" Dvendor="Infineon:7">
      <processor Dcore="Cortex-M3" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian"/>
      <description>
        The TLE988x/TLE989x series is designed for 3-phase motor drive applications with CAN interface
        - Ultra low power consumption
        - Nested Vectored Interrupt Controller (NVIC)
        - Integrated CAN transceiver
        - DMA (selected derivatives)
        - Current Sense Amplifier (selected derivatives)
      </description>
      <environment name="uv">
      </environment>
      <subFamily DsubFamily="TLE988x Series">
        <device Dname="TLE9881">
          <processor Dclock="60000000"/>
          <debug svd="device/tlelib/cfgwiz/xml/tle988x.svd"/>
          <memory name="Flash0" access="rx" start="0x11000000" size="0x6000" startup="1" default="1"/>
          <memory name="Flash1" access="rx" start="0x12002000" size="0x1E000" startup="0" default="1"/>
          <memory name="PSRAM" access="rwx" start="0x18000000" size="0x2000" init="0" default="1"/>
          <memory name="DSRAM" access="rw" start="0x18002000" size="0x2000" init="0" default="1"/>
          <algorithm name="flash/TLE9881_FLASH0_UBSL.FLM" start="0x11000000" size="0x6000" default="1"/>
          <algorithm name="flash/TLE9881_FLASH0_DATAFLASH.FLM" start="0x11006000" size="0x2000" default="1"/>
          <algorithm name="flash/TLE9881_FLASH1.FLM" start="0x12002000" size="0x1E000" default="1"/>
          <book name="documents/Infineon-TLE988x9x_User_Manual-UserManual-v01_00-EN.pdf" title="TLE988x/TLE989x User Manual"/>
          <book name="documents/Infineon-TLE988x_9x_Firmware_User_Manual-UserManual-v01_00-EN.pdf" title="TLE988x/TLE989x Firmware User Manual"/>
          <book name="documents/Infineon-TLE988x_9x_DataSheet-DataSheet-v01_10-EN.pdf" title="TLE988x/TLE989x Datasheet"/>
          <book name="documents/html/index.html" title="SDK Help"/>
          <variant Dvariant="TLE9881_2QTW60">
            <compile header="device/tlelib/inc/tle989x.h" define="TLE9881_2QTW60"/>
          </variant>
        </device>
        <device Dname="TLE9883">
          <processor Dclock="60000000"/>
          <debug svd="device/tlelib/cfgwiz/xml/tle988x.svd"/>
          <memory name="Flash0" access="rx" start="0x11000000" size="0x6000" startup="1" default="1"/>
          <memory name="Flash1" access="rx" start="0x12002000" size="0x3E000" startup="0" default="1"/>
          <memory name="PSRAM" access="rwx" start="0x18000000" size="0x2000" init="0" default="1"/>
          <memory name="DSRAM" access="rw" start="0x18002000" size="0x5C00" init="0" default="1"/>
          <algorithm name="flash/TLE9883_FLASH0_UBSL.FLM" start="0x11000000" size="0x6000" default="1"/>
          <algorithm name="flash/TLE9883_FLASH0_DATAFLASH.FLM" start="0x11006000" size="0x2000" default="1"/>
          <algorithm name="flash/TLE9883_FLASH1.FLM" start="0x12002000" size="0x3E000" default="1"/>
          <book name="documents/Infineon-TLE988x9x_User_Manual-UserManual-v01_00-EN.pdf" title="TLE988x/TLE989x User Manual"/>
          <book name="documents/Infineon-TLE988x_9x_Firmware_User_Manual-UserManual-v01_00-EN.pdf" title="TLE988x/TLE989x Firmware User Manual"/>
          <book name="documents/Infineon-TLE988x_9x_DataSheet-DataSheet-v01_10-EN.pdf" title="TLE988x/TLE989x Datasheet"/>
          <book name="documents/html/index.html" title="SDK Help"/>
          <variant Dvariant="TLE9883_2QTW62S">
            <compile header="device/tlelib/inc/tle989x.h" define="TLE9883_2QTW62S"/>
          </variant>
          <variant Dvariant="TLE9883QTA62">
            <compile header="device/tlelib/inc/tle989x.h" define="TLE9883QTA62"/>
          </variant>
        </device>
      </subFamily>
      <subFamily DsubFamily="TLE989x Series">
        <device Dname="TLE9891">
          <processor Dclock="60000000"/>
          <debug svd="device/tlelib/cfgwiz/xml/tle989x.svd"/>
          <memory name="Flash0" access="rx" start="0x11000000" size="0x6000" startup="1" default="1"/>
          <memory name="Flash1" access="rx" start="0x12002000" size="0x1E000" startup="0" default="1"/>
          <memory name="PSRAM" access="rwx" start="0x18000000" size="0x2000" init="0" default="1"/>
          <memory name="DSRAM" access="rw" start="0x18002000" size="0x2000" init="0" default="1"/>
          <algorithm name="flash/TLE9891_FLASH0_UBSL.FLM" start="0x11000000" size="0x6000" default="1"/>
          <algorithm name="flash/TLE9891_FLASH0_DATAFLASH.FLM" start="0x11006000" size="0x2000" default="1"/>
          <algorithm name="flash/TLE9891_FLASH1.FLM" start="0x12002000" size="0x1E000" default="1"/>
          <book name="documents/Infineon-TLE988x9x_User_Manual-UserManual-v01_00-EN.pdf" title="TLE988x/TLE989x User Manual"/>
          <book name="documents/Infineon-TLE988x_9x_Firmware_User_Manual-UserManual-v01_00-EN.pdf" title="TLE988x/TLE989x Firmware User Manual"/>
          <book name="documents/Infineon-TLE988x_9x_DataSheet-DataSheet-v01_10-EN.pdf" title="TLE988x/TLE989x Datasheet"/>
          <book name="documents/html/index.html" title="SDK Help"/>
          <variant Dvariant="TLE9891QTA61">
            <compile header="device/tlelib/inc/tle989x.h" define="TLE9891QTA61"/>
          </variant>
          <variant Dvariant="TLE9891_2QTW60">
            <compile header="device/tlelib/inc/tle989x.h" define="TLE9891_2QTW60"/>
          </variant>
          <variant Dvariant="TLE9891_2QTW61">
            <compile header="device/tlelib/inc/tle989x.h" define="TLE9891_2QTW61"/>
          </variant>
        </device>
