vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.TLE988x_9x_DFP.pdsc
        <device Dname="TLE9893">
          <processor Dclock="60000000"/>
          <debug svd="device/tlelib/cfgwiz/xml/tle989x.svd"/>
          <memory name="Flash0" access="rx" start="0x11000000" size="0x6000" startup="1" default="1"/>
          <memory name="Flash1" access="rx" start="0x12002000" size="0x3E000" startup="0" default="1"/>
          <memory name="PSRAM" access="rwx" start="0x18000000" size="0x2000" init="0" default="1"/>
          <memory name="DSRAM" access="rw" start="0x18002000" size="0x5C00" init="0" default="1"/>
          <algorithm name="flash/TLE9893_FLASH0_UBSL.FLM" start="0x11000000" size="0x6000" default="1"/>
          <algorithm name="flash/TLE9893_FLASH0_DATAFLASH.FLM" start="0x11006000" size="0x2000" default="1"/>
          <algorithm name="flash/TLE9893_FLASH1.FLM" start="0x12002000" size="0x3E000" default="1"/>
          <book name="documents/Infineon-TLE988x9x_User_Manual-UserManual-v01_00-EN.pdf" title="TLE988x/TLE989x User Manual"/>
          <book name="documents/Infineon-TLE988x_9x_Firmware_User_Manual-UserManual-v01_00-EN.pdf" title="TLE988x/TLE989x Firmware User Manual"/>
          <book name="documents/Infineon-TLE988x_9x_DataSheet-DataSheet-v01_10-EN.pdf" title="TLE988x/TLE989x Datasheet"/>
          <book name="documents/html/index.html" title="SDK Help"/>
          <variant Dvariant="TLE9893QKW62S">
            <compile header="device/tlelib/inc/tle989x.h" define="TLE9893QKW62S"/>
          </variant>
          <variant Dvariant="TLE9893_2QTA62">
            <compile header="device/tlelib/inc/tle989x.h" define="TLE9893_2QTA62"/>
          </variant>
          <variant Dvariant="TLE9893_2QTW62S">
            <compile header="device/tlelib/inc/tle989x.h" define="TLE9893_2QTW62S"/>
          </variant>
          <variant Dvariant="TLE9893_2QTA62S">
            <compile header="device/tlelib/inc/tle989x.h" define="TLE9893_2QTA62S"/>
          </variant>
          <variant Dvariant="TLE9893_2QKW62S">
            <compile header="device/tlelib/inc/tle989x.h" define="TLE9893_2QKW62S"/>
          </variant>
        </device>
      </subFamily>
    </family>
  </devices>
  <conditions>
    <condition id="cond_TLE988x_9x_startup_modules">
      <description>Infineon TLE988x/TLE989x device series</description>
      <require Cclass="CMSIS" Cgroup="CORE" Csub=""/>
      <require Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
      <require Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
      <require Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
      <require Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
      <require Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
      <require Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="TLELib" Csub="INT"/>
      <require Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
      <require Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
      <require Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
      <accept condition="cond_any_TLE988x_9x_device"/>
      <accept Cclass="Device" Cgroup="ConfigWizard" Csub=""/>
    </condition>
    <condition id="cond_TLE988x_9x_startup">
      <description>Infineon TLE988x/TLE989x device series</description>
      <require condition="cond_TLE988x_9x_startup_modules"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
    </condition>
    <condition id="cond_any_Config_Wizard">
      <require Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="TLELib" Csub="INT"/>
      <require Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
      <require Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
      <require Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_any_TLE988x_device">
      <description>Infineon TLE988x device series</description>
      <accept Dvendor="Infineon:7" Dname="TLE988*"/>
    </condition>
    <condition id="cond_any_TLE989x_device">
      <description>Infineon TLE989x device series</description>
      <accept Dvendor="Infineon:7" Dname="TLE989*"/>
    </condition>
    <condition id="cond_any_TLE988x_9x_device">
      <description>Infineon TLE988x/TLE989x device series</description>
      <accept Dvendor="Infineon:7" Dname="TLE988*"/>
      <accept Dvendor="Infineon:7" Dname="TLE989*"/>
    </condition>
    <condition id="cond_TLE988x">
      <description>Infineon TLE988x device</description>
      <require Dvendor="Infineon:7" Dname="TLE988*"/>
    </condition>
    <condition id="cond_TLE989x">
      <description>Infineon TLE989x device</description>
      <require Dvendor="Infineon:7" Dname="TLE989*"/>
    </condition>
    <!-- 48 or 64 pin -->
    <condition id="cond_TLE988x_9x_48pin">
      <description>Infineon TLE988x/9x device with 48 pin</description>
      <accept Dvendor="Infineon:7" Dname="TLE989*T*"/>
      <accept Dvendor="Infineon:7" Dname="TLE988*T*"/>
    </condition>
    <condition id="cond_TLE988x_9x_64pin">
      <description>Infineon TLE988x/9x device with 64 pin</description>
      <accept Dvendor="Infineon:7" Dname="TLE989*K*"/>
      <accept Dvendor="Infineon:7" Dname="TLE988*K*"/>
    </condition>
    <!-- One condition for every device, for adding the correct icwp and defines -->
    <condition id="cond_TLE9881_2QTW60">
      <require Dvendor="Infineon:7" Dname="TLE9881_2QTW60"/>
    </condition>
    <condition id="cond_TLE9883_2QTW62S">
      <require Dvendor="Infineon:7" Dname="TLE9883_2QTW62S"/>
    </condition>
    <condition id="cond_TLE9883QTA62">
      <require Dvendor="Infineon:7" Dname="TLE9883QTA62"/>
    </condition>
    <condition id="cond_TLE9891_2QTW60">
      <require Dvendor="Infineon:7" Dname="TLE9891_2QTW60"/>
    </condition>
    <condition id="cond_TLE9891_2QTW61">
      <require Dvendor="Infineon:7" Dname="TLE9891_2QTW61"/>
    </condition>
    <condition id="cond_TLE9891QTA61">
      <require Dvendor="Infineon:7" Dname="TLE9891QTA61"/>
    </condition>
    <condition id="cond_TLE9893_2QKW62S">
      <require Dvendor="Infineon:7" Dname="TLE9893_2QKW62S"/>
    </condition>
