vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.TLE988x_9x_DFP.pdsc
    <condition id="cond_TLE9893_2QTA62">
      <require Dvendor="Infineon:7" Dname="TLE9893_2QTA62"/>
    </condition>
    <condition id="cond_TLE9893_2QTA62S">
      <require Dvendor="Infineon:7" Dname="TLE9893_2QTA62S"/>
    </condition>
    <condition id="cond_TLE9893_2QTW62S">
      <require Dvendor="Infineon:7" Dname="TLE9893_2QTW62S"/>
    </condition>
    <condition id="cond_TLE9893QKW62S">
      <require Dvendor="Infineon:7" Dname="TLE9893QKW62S"/>
    </condition>
    <!-- One condition for every module -->
    <condition id="cond_TLE988x_9x_ADC1">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_ADC2">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_BDRV">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_BOOTROM">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_CANCONTR">
      <accept condition="cond_any_TLE988x_9x_device"/>
      <deny Cclass="Device" Cgroup="TLELib" Csub="CANCOM"/>
    </condition>
    <condition id="cond_TLE988x_9x_CANTRX">
      <accept condition="cond_any_TLE988x_9x_device"/>
      <deny Cclass="Device" Cgroup="TLELib" Csub="CANCOM"/>
    </condition>
    <condition id="cond_TLE988x_9x_CANCOM">
      <accept condition="cond_any_TLE988x_9x_device"/>
      <!-- CANCOM currently only exists for ARM -->
      <require condition="cond_TLE988x_9x_ARM"/>
      <deny Cclass="Device" Cgroup="TLELib" Csub="CANCONTR"/>
      <deny Cclass="Device" Cgroup="TLELib" Csub="CANTRX"/>
    </condition>
    <condition id="cond_TLE988x_9x_CCU7">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_CSACSC">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_DMA">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_GPIO">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_GPT12">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_INT">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_ISR">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_MON">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_PMU">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_SCU">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_SDADC">
      <accept Dvendor="Infineon:7" Dname="TLE9881_2QTW60"/>
      <accept Dvendor="Infineon:7" Dname="TLE9883_2QTW62S"/>
      <accept Dvendor="Infineon:7" Dname="TLE9891_2QTW60"/>
      <accept Dvendor="Infineon:7" Dname="TLE9891_2QTW61"/>
      <accept Dvendor="Infineon:7" Dname="TLE9893_2QTA62"/>
      <accept Dvendor="Infineon:7" Dname="TLE9893_2QTW62S"/>
      <accept Dvendor="Infineon:7" Dname="TLE9893_2QTA62S"/>
      <accept Dvendor="Infineon:7" Dname="TLE9893_2QKW62S"/>
    </condition>
    <condition id="cond_TLE988x_9x_SSC">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_TIMER2X">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <condition id="cond_TLE988x_9x_UART">
      <accept condition="cond_any_TLE988x_9x_device"/>
    </condition>
    <!-- conditions for compiler -->
    <condition id="cond_TLE988x_9x_ARM">
      <description>Infineon TLE988x/9x device series with ARMCC</description>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="cond_TLE988x_9x_IAR">
      <description>Infineon TLE988x/9x device series with IAR</description>
      <require Tcompiler="IAR"/>
    </condition>
    <!-- conditions for memory size and Compiler to select the correct linker file -->
    <condition id="cond_TLE9881_91_ARM">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="Infineon:7" Dname="TLE9881*"/>
      <accept Dvendor="Infineon:7" Dname="TLE9891*"/>
    </condition>
    <condition id="cond_TLE9883_93_ARM">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="Infineon:7" Dname="TLE9883*"/>
      <accept Dvendor="Infineon:7" Dname="TLE9893*"/>
    </condition>
    <condition id="cond_TLE9881_IAR">
      <require Tcompiler="IAR"/>
      <accept Dvendor="Infineon:7" Dname="TLE9881*"/>
    </condition>
    <condition id="cond_TLE9883_IAR">
      <require Tcompiler="IAR"/>
      <accept Dvendor="Infineon:7" Dname="TLE9883*"/>
    </condition>
    <condition id="cond_TLE9891_IAR">
      <require Tcompiler="IAR"/>
      <accept Dvendor="Infineon:7" Dname="TLE9891*"/>
    </condition>
    <condition id="cond_TLE9893_IAR">
      <require Tcompiler="IAR"/>
      <accept Dvendor="Infineon:7" Dname="TLE9893*"/>
    </condition>
    <condition id="cond_TLE9881_2QTW60_ARM">
      <description>TLE9881_2QTW60 with ARMCC</description>
      <require Tcompiler="ARMCC"/>
      <require Dvendor="Infineon:7" Dname="TLE9881_2QTW60"/>
    </condition>
    <condition id="cond_TLE9881_2QTW60_IAR">
      <description>TLE9881_2QTW60 with IAR</description>
      <require Tcompiler="IAR"/>
      <require Dvendor="Infineon:7" Dname="TLE9881_2QTW60"/>
    </condition>
    <condition id="cond_TLE9883_2QTW62S_ARM">
      <description>TLE9883_2QTW62S with ARMCC</description>
      <require Tcompiler="ARMCC"/>
      <require Dvendor="Infineon:7" Dname="TLE9883_2QTW62S"/>
    </condition>
    <condition id="cond_TLE9883_2QTW62S_IAR">
      <description>TLE9883_2QTW62S with IAR</description>
      <require Tcompiler="IAR"/>
      <require Dvendor="Infineon:7" Dname="TLE9883_2QTW62S"/>
    </condition>
