vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.TLE988x_9x_DFP.pdsc
    <condition id="cond_TLE9883QTA62_ARM">
      <description>TLE9883QTA62 with ARMCC</description>
      <require Tcompiler="ARMCC"/>
      <require Dvendor="Infineon:7" Dname="TLE9883QTA62"/>
    </condition>
    <condition id="cond_TLE9883QTA62_IAR">
      <description>TLE9883QTA62 with IAR</description>
      <require Tcompiler="IAR"/>
      <require Dvendor="Infineon:7" Dname="TLE9883QTA62"/>
    </condition>
    <condition id="cond_TLE9891_2QTW60_ARM">
      <description>TLE9891_2QTW60 with ARMCC</description>
      <require Tcompiler="ARMCC"/>
      <require Dvendor="Infineon:7" Dname="TLE9891_2QTW60"/>
    </condition>
    <condition id="cond_TLE9891_2QTW60_IAR">
      <description>TLE9891_2QTW60 with IAR</description>
      <require Tcompiler="IAR"/>
      <require Dvendor="Infineon:7" Dname="TLE9891_2QTW60"/>
    </condition>
    <condition id="cond_TLE9891_2QTW61_ARM">
      <description>TLE9891_2QTW61 with ARMCC</description>
      <require Tcompiler="ARMCC"/>
      <require Dvendor="Infineon:7" Dname="TLE9891_2QTW61"/>
    </condition>
    <condition id="cond_TLE9891_2QTW61_IAR">
      <description>TLE9891_2QTW61 with IAR</description>
      <require Tcompiler="IAR"/>
      <require Dvendor="Infineon:7" Dname="TLE9891_2QTW61"/>
    </condition>
    <condition id="cond_TLE9891QTA61_ARM">
      <description>TLE9891QTA61 with ARMCC</description>
      <require Tcompiler="ARMCC"/>
      <require Dvendor="Infineon:7" Dname="TLE9891QTA61"/>
    </condition>
    <condition id="cond_TLE9891QTA61_IAR">
      <description>TLE9891QTA61 with IAR</description>
      <require Tcompiler="IAR"/>
      <require Dvendor="Infineon:7" Dname="TLE9891QTA61"/>
    </condition>
    <condition id="cond_TLE9893_2QKW62S_ARM">
      <description>TLE9893_2QKW62S with ARMCC</description>
      <require Tcompiler="ARMCC"/>
      <require Dvendor="Infineon:7" Dname="TLE9893_2QKW62S"/>
    </condition>
    <condition id="cond_TLE9893_2QKW62S_IAR">
      <description>TLE9893_2QKW62S with IAR</description>
      <require Tcompiler="IAR"/>
      <require Dvendor="Infineon:7" Dname="TLE9893_2QKW62S"/>
    </condition>
    <condition id="cond_TLE9893_2QTA62_ARM">
      <description>TLE9893_2QTA62 with ARMCC</description>
      <require Tcompiler="ARMCC"/>
      <require Dvendor="Infineon:7" Dname="TLE9893_2QTA62"/>
    </condition>
    <condition id="cond_TLE9893_2QTA62_IAR">
      <description>TLE9893_2QTA62 with IAR</description>
      <require Tcompiler="IAR"/>
      <require Dvendor="Infineon:7" Dname="TLE9893_2QTA62"/>
    </condition>
    <condition id="cond_TLE9893_2QTA62S_ARM">
      <description>TLE9893_2QTA62S with ARMCC</description>
      <require Tcompiler="ARMCC"/>
      <require Dvendor="Infineon:7" Dname="TLE9893_2QTA62S"/>
    </condition>
    <condition id="cond_TLE9893_2QTA62S_IAR">
      <description>TLE9893_2QTA62S with IAR</description>
      <require Tcompiler="IAR"/>
      <require Dvendor="Infineon:7" Dname="TLE9893_2QTA62S"/>
    </condition>
    <condition id="cond_TLE9893_2QTW62S_ARM">
      <description>TLE9893_2QTW62S with ARMCC</description>
      <require Tcompiler="ARMCC"/>
      <require Dvendor="Infineon:7" Dname="TLE9893_2QTW62S"/>
    </condition>
    <condition id="cond_TLE9893_2QTW62S_IAR">
      <description>TLE9893_2QTW62S with IAR</description>
      <require Tcompiler="IAR"/>
      <require Dvendor="Infineon:7" Dname="TLE9893_2QTW62S"/>
    </condition>
    <condition id="cond_TLE9893QKW62S_ARM">
      <description>TLE9893QKW62S with ARMCC</description>
      <require Tcompiler="ARMCC"/>
      <require Dvendor="Infineon:7" Dname="TLE9893QKW62S"/>
    </condition>
    <condition id="cond_TLE9893QKW62S_IAR">
      <description>TLE9893QKW62S with IAR</description>
      <require Tcompiler="IAR"/>
      <require Dvendor="Infineon:7" Dname="TLE9893QKW62S"/>
    </condition>
  </conditions>
  <boards>
    <board vendor="Infineon" name="TLE988x/TLE989x EvalBoard" revision="V1.0" salesContact="sales@infineon.com" orderForm="http://www.infineon.com/embeddedpower">
      <description>Infineon TLE988x/TLE989x EvalKit Board Support and Examples</description>
      <book category="overview" name="https://www.infineon.com/cms/de/product/evaluation-boards/tle989x-evalb_lqfp/" title="TLE989x EvalBoard LQFP Web Page"/>
      <book category="overview" name="https://www.infineon.com/cms/de/product/evaluation-boards/tle989x-evalb_tqfp/" title="TLE989x EvalBoard TQFP Web Page"/>
      <book name="documents/Infineon-TLE988x_9x_Evalboard-UG-v01_1-EN-UserManual-v01_00-EN.pdf" title="TLE988x/TLE989x EvalBoard User Guide"/>
      <mountedDevice deviceIndex="0" Dvendor="Infineon:7" Dname="TLE9893"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE989x Series" Dname="TLE9891"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE989x Series" Dname="TLE9881"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE989x Series" Dname="TLE9883"/>
    </board>
  </boards>
  <apis>
    <api Cclass="Device Driver" Cgroup="TLELib">
      <files>
        <file category="header" name="device/tlelib/lib/can_types.h" version="301.0"/>
        <file category="header" name="device/tlelib/lib/Can_Api.h" version="301.0"/>
        <file category="header" name="device/tlelib/lib/com_types.h" version="301.0"/>
        <file category="header" name="device/tlelib/lib/Com_Api.h" version="301.0"/>
      </files>
    </api>
  </apis>
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.4.0" condition="cond_TLE988x_9x_startup">
      <description>System Startup C for Infineon TLE988x/TLE989x device series</description>
      <files>
        <file category="source" attr="config" name="device/startup/c/startup_tle989x.c" condition="cond_TLE988x_9x_IAR" version="0.1.5"/>
        <file category="source" attr="config" name="device/startup/c/startup_tle989x.c" condition="cond_TLE988x_9x_ARM" version="0.1.5"/>
        <file category="linkerScript" attr="config" name="device/startup/c/tle9881_91.sct" condition="cond_TLE9881_91_ARM" version="1.1.0"/>
        <file category="linkerScript" attr="config" name="device/startup/c/tle9883_93.sct" condition="cond_TLE9883_93_ARM" version="1.0.0"/>
        <file category="linkerScript" attr="config" name="device/startup/c/TLE9881.icf" condition="cond_TLE9881_IAR" version="0.1.0"/>
        <file category="linkerScript" attr="config" name="device/startup/c/TLE9883.icf" condition="cond_TLE9883_IAR" version="0.1.0"/>
        <file category="linkerScript" attr="config" name="device/startup/c/TLE9891.icf" condition="cond_TLE9891_IAR" version="0.1.0"/>
        <file category="linkerScript" attr="config" name="device/startup/c/TLE9893.icf" condition="cond_TLE9893_IAR" version="0.1.0"/>
        <file category="source" attr="config" name="device/startup/src/system_tle989x.c" version="0.4.7"/>
        <file category="header" attr="config" name="device/startup/inc/system_tle989x.h" version="0.4.7"/>
        <file category="source" attr="config" name="device/tlelib/src/tle_device.c" version="0.4.0"/>
        <file category="header" attr="config" name="device/tlelib/inc/tle_device.h" version="0.4.0"/>
        <file category="header" attr="config" name="device/tlelib/inc/tle_variants.h" version="0.4.5"/>
        <file category="header" attr="config" name="device/tlelib/inc/types.h" version="0.4.3"/>
        <file category="header" attr="config" name="device/tlelib/inc/error_codes.h" version="0.3.2"/>
        <file category="header" attr="config" name="device/tlelib/inc/cmsis_misra.h" version="0.2.5"/>
        <file category="header" attr="config" name="device/tlelib/inc/tle989x.h" version="0.6.0"/>
        <file category="sourceC" attr="template" name="device/tlelib/main/main.c" select="Simple Main" version="1.5.6"/>
        <file category="doc" name="documents/html/index.html"/>
        <!-- for F1 help -->
      </files>
    </component>
