vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.TLE988x_9x_DFP.pdsc
    <component Cclass="Device" Cgroup="ConfigWizard" condition="cond_any_Config_Wizard" Cversion="0.0.0">
      <description>Infineon ConfigWizard Configuration File</description>
      <RTE_Components_h>
        #define CONFIGWIZARD 2
      </RTE_Components_h>
      <files>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn.xml" version="0.6.2"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/tle988x.svd" version="1.1.0" condition="cond_any_TLE988x_device"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/tle989x.svd" version="1.1.0" condition="cond_any_TLE989x_device"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/tle989x_48.pin" version="0.5.0" condition="cond_TLE988x_9x_48pin"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/tle989x_64.pin" version="0.5.0" condition="cond_TLE988x_9x_64pin"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/adc1.py" version="0.1.6"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/adc2.py" version="0.1.8"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/ccu7_calc.py" version="0.1.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/scu.py" version="0.1.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/timer2x.py" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/uart.py" version="0.1.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/bsl_defines_inc_save_handler.py" version="0.2.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_adc1.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_adc2.xml" version="0.0.8"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_BDRV.xml" version="0.3.0"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_bemf.xml" version="0.0.9"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_bsl.xml" version="0.1.1"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_cantrx.xml" version="0.0.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_CCU7.xml" version="0.4.0"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_CSACSC.xml" version="0.2.2"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_dma.xml" version="0.0.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_gpio.xml" version="0.2.2"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_gpt12.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_interrupt.xml" version="0.4.1"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_mon.xml" version="0.1.6"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_pmu.xml" version="0.1.9"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_scu.xml" version="0.3.1"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_sdadc.xml" version="0.0.9"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_SSC.xml" version="0.1.1"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_timer2x.xml" version="0.1.9"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/icw_ocn_UARTx.xml" version="0.1.9"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc1_calibration.xml" version="0.2.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc1_channel.xml" version="0.3.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc1_channel_class.xml" version="0.2.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc1_compare.xml" version="0.2.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc1_filter.xml" version="0.2.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc1_sequencer.xml" version="0.2.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc1_sequencer_slots.xml" version="0.2.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc1_sequencer_variables.xml" version="0.2.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc1_variables2.xml" version="0.2.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc2_channel.xml" version="0.0.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc2_channel_class.xml" version="0.0.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc2_channel_user.xml" version="0.0.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc2_compare.xml" version="0.0.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc2_compare_fix.xml" version="0.0.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc2_compare_fix_nmi_up.xml" version="0.0.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc2_compare_fix_nmi_lo.xml" version="0.0.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc2_compare_fix_nmi_uplo.xml" version="0.0.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc2_filter.xml" version="0.0.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc2_filter_fix.xml" version="0.0.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc2_sequencer.xml" version="0.0.6"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_adc2_sequencer_slots.xml" version="0.0.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_bdrv_currentsConst.xml" version="0.1.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_bdrv_currentsSeq.xml" version="0.1.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_bdrv_timingsConst.xml" version="0.1.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_bdrv_timingsSeq.xml" version="0.1.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_bdrv_hb_chrg_dischrg_settings.xml" version="0.0.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_bdrv_hb_graph.xml" version="0.0.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_bdrv_hb_settings.xml" version="0.0.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_ccu7_cmpval_input.xml" version="0.1.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_ccu7_perval_input.xml" version="0.1.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_ccu7_sum_cmpval.xml" version="0.1.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_ccu7_sum_t1x.xml" version="0.1.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_ccu7_t12.xml" version="0.1.8"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_ccu7_t13.xml" version="0.1.6"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_ccu7_t141516.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_ccu7_deadtime_graph.xml" version="0.0.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_dma_mode.xml" version="0.0.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_gpio_p0p1.xml" version="0.1.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_gpio_p2.xml" version="0.1.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_gpt12_mode.xml" version="0.3.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_gpt12_timer.xml" version="0.1.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_adc1.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_adc2.xml" version="0.1.8"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_bemf_sdadc.xml" version="0.3.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_can.xml" version="0.1.6"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_ccu7.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_dma.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_extint.xml" version="0.2.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_gpt12.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_memctrl.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_mon.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_ssc.xml" version="0.1.6"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_t20.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_t21.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_uart.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_interrupt_overview_warn.xml" version="0.1.7"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_pmu_gpiowake.xml" version="0.2.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_pmu_interrupt.xml" version="0.1.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_pmu_timer.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_sdadc_channel.xml" version="0.2.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_sdadc_interrupt.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_sdadc_timers.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_ssc_graph.xml" version="0.1.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_ssc_mode.xml" version="0.1.8"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_ssc_pinsel.xml" version="0.2.3"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_ssc_timer.xml" version="0.1.6"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_t2x_graph.xml" version="0.1.5"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_t2x_mode.xml" version="0.3.4"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_uart_graph.xml" version="0.1.6"/>
        <file category="doc" attr="config" name="device/tlelib/cfgwiz/xml/template_uart_mode.xml" version="0.3.4"/>
        <!-- icwp files and defines are device specific -->
        <!-- TLE9881_2QTW60 -->
        <file condition="cond_TLE9881_2QTW60" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/config.icwp" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/adc1_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/adc2_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/bdrv_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/bsl_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60_ARM" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/bsl_defines_ARM.inc" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60_IAR" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/bsl_defines_IAR.inc" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/cantrx_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/ccu7_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/csacsc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/dma_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/gpio_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/gpt12_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/isr_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/pmu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/scu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/sdadc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/ssc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/timer2x_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9881_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9881_2QTW60/uart_defines.h" version="0.0.0"/>
        <!-- TLE9883_2QTW62S -->
        <file condition="cond_TLE9883_2QTW62S" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/config.icwp" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/adc1_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/adc2_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/bdrv_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/bsl_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S_ARM" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/bsl_defines_ARM.inc" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S_IAR" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/bsl_defines_IAR.inc" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/cantrx_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/ccu7_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/csacsc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/dma_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/gpio_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/gpt12_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/isr_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/pmu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/scu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/sdadc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/ssc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/timer2x_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883_2QTW62S/uart_defines.h" version="0.0.0"/>
        <!-- TLE9883QTA62 -->
        <file condition="cond_TLE9883QTA62" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/config.icwp" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/adc1_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/adc2_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/bdrv_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/bsl_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62_ARM" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/bsl_defines_ARM.inc" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62_IAR" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/bsl_defines_IAR.inc" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/cantrx_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/ccu7_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/csacsc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/dma_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/gpio_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/gpt12_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/isr_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/pmu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/scu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/ssc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/timer2x_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9883QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9883QTA62/uart_defines.h" version="0.0.0"/>
        <!-- TLE9891_2QTW60 -->
        <file condition="cond_TLE9891_2QTW60" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/config.icwp" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/adc1_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/adc2_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/bdrv_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/bsl_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60_ARM" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/bsl_defines_ARM.inc" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60_IAR" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/bsl_defines_IAR.inc" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/cantrx_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/ccu7_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/csacsc_defines.h" version="0.0.0"/>
