vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.TLE988x_9x_DFP.pdsc
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/dma_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/gpio_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/gpt12_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/isr_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/pmu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/scu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/sdadc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/ssc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/timer2x_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW60" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW60/uart_defines.h" version="0.0.0"/>
        <!-- TLE9891_2QTW61 -->
        <file condition="cond_TLE9891_2QTW61" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/config.icwp" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/adc1_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/adc2_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/bdrv_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/bsl_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61_ARM" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/bsl_defines_ARM.inc" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61_IAR" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/bsl_defines_IAR.inc" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/cantrx_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/ccu7_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/csacsc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/dma_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/gpio_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/gpt12_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/isr_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/pmu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/scu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/sdadc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/ssc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/timer2x_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891_2QTW61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891_2QTW61/uart_defines.h" version="0.0.0"/>
        <!-- TLE9891QTA61 -->
        <file condition="cond_TLE9891QTA61" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/config.icwp" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/adc1_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/adc2_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/bdrv_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/bsl_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61_ARM" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/bsl_defines_ARM.inc" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61_IAR" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/bsl_defines_IAR.inc" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/cantrx_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/ccu7_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/csacsc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/dma_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/gpio_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/gpt12_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/isr_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/pmu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/scu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/ssc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/timer2x_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9891QTA61" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9891QTA61/uart_defines.h" version="0.0.0"/>
        <!-- TLE9893_2QKW62S -->
        <file condition="cond_TLE9893_2QKW62S" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/config.icwp" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/adc1_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/adc2_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/bdrv_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/bsl_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S_ARM" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/bsl_defines_ARM.inc" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S_IAR" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/bsl_defines_IAR.inc" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/cantrx_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/ccu7_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/csacsc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/dma_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/gpio_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/gpt12_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/isr_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/pmu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/scu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/sdadc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/ssc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/timer2x_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QKW62S/uart_defines.h" version="0.0.0"/>
        <!-- TLE9893_2QTA62 -->
        <file condition="cond_TLE9893_2QTA62" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/config.icwp" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/adc1_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/adc2_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/bdrv_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/bsl_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62_ARM" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/bsl_defines_ARM.inc" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62_IAR" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/bsl_defines_IAR.inc" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/cantrx_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/ccu7_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/csacsc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/dma_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/gpio_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/gpt12_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/isr_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/pmu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/scu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/sdadc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/ssc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/timer2x_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62/uart_defines.h" version="0.0.0"/>
        <!-- TLE9893_2QTA62S -->
        <file condition="cond_TLE9893_2QTA62S" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/config.icwp" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/adc1_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/adc2_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/bdrv_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/bsl_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S_ARM" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/bsl_defines_ARM.inc" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S_IAR" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/bsl_defines_IAR.inc" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/cantrx_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/ccu7_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/csacsc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/dma_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/gpio_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/gpt12_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/isr_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/pmu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/scu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/sdadc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/ssc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/timer2x_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTA62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTA62S/uart_defines.h" version="0.0.0"/>
        <!-- TLE9893_2QTW62S -->
        <file condition="cond_TLE9893_2QTW62S" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/config.icwp" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/adc1_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/adc2_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/bdrv_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/bsl_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S_ARM" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/bsl_defines_ARM.inc" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S_IAR" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/bsl_defines_IAR.inc" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/cantrx_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/ccu7_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/csacsc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/dma_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/gpio_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/gpt12_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/isr_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/pmu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/scu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/sdadc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/ssc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/timer2x_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893_2QTW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893_2QTW62S/uart_defines.h" version="0.0.0"/>
        <!-- TLE9893QKW62S -->
        <file condition="cond_TLE9893QKW62S" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/config.icwp" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/adc1_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/adc2_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/bdrv_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/bsl_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S_ARM" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/bsl_defines_ARM.inc" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S_IAR" category="doc" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/bsl_defines_IAR.inc" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/cantrx_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/ccu7_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/csacsc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/dma_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/gpio_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/gpt12_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/isr_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/pmu_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/scu_defines.h" version="0.0.0"/>
