vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.TLE988x_9x_DFP.pdsc
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/ssc_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/timer2x_defines.h" version="0.0.0"/>
        <file condition="cond_TLE9893QKW62S" category="header" attr="config" name="device/tlelib/cfgwiz/defines/TLE9893QKW62S/uart_defines.h" version="0.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="ADC1" condition="cond_TLE988x_9x_ADC1" Cversion="0.6.1">
      <description>Analog Digital Converter 1 (ADC1) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_ADC1
      </RTE_Components_h>
      <files>
        <file category="header" attr="config" name="device/tlelib/inc/adc1.h" version="0.6.1"/>
        <file category="source" attr="config" name="device/tlelib/src/adc1.c" version="0.6.1"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="ADC2" condition="cond_TLE988x_9x_ADC2" Cversion="0.5.8">
      <description>Analog Digital Converter 2 (ADC2) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_ADC2
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/adc2.h" attr="config" version="0.5.8"/>
        <file category="source" name="device/tlelib/src/adc2.c" attr="config" version="0.5.8"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="BDRV" condition="cond_TLE988x_9x_BDRV" Cversion="0.9.2">
      <description>Bridge Driver (BDRV) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_BDRV
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/bdrv.h" attr="config" version="0.9.2"/>
        <file category="source" name="device/tlelib/src/bdrv.c" attr="config" version="0.9.2"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM" condition="cond_TLE988x_9x_BOOTROM" Cversion="0.3.4">
      <description>BootROM driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_BOOTROM
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/bootrom.h" attr="config" version="0.3.4"/>
        <file category="source" name="device/tlelib/src/bootrom.c" attr="config" version="0.3.4"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="CANCONTR" condition="cond_TLE988x_9x_CANCONTR" Cversion="0.3.5">
      <description>CAN driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_CANCONTR
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/can.h" attr="config" version="0.3.5"/>
        <file category="source" name="device/tlelib/src/can.c" attr="config" version="0.3.5"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="CANTRX" condition="cond_TLE988x_9x_CANTRX" Cversion="0.3.5">
      <description>CANTRX driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_CANTRX
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/cantrx.h" attr="config" version="0.3.5"/>
        <file category="source" name="device/tlelib/src/cantrx.c" attr="config" version="0.3.5"/>
      </files>
    </component>
    <component Cclass="Device Driver" Cgroup="TLELib" Csub="CANCOM" condition="cond_TLE988x_9x_CANCOM" Cversion="301.0">
      <description>IHR CAN/COM stack for TLE988x/TLE989x</description>
      <files>
        <file category="library" name="device/tlelib/lib/CanDriverLib_Demo.lib" version="301.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="CCU7" condition="cond_TLE988x_9x_CCU7" Cversion="0.5.1">
      <description>Capture compare Unit 7 (CCU7) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_CCU7
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/ccu7.h" attr="config" version="0.5.1"/>
        <file category="source" name="device/tlelib/src/ccu7.c" attr="config" version="0.5.1"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC" condition="cond_TLE988x_9x_CSACSC" Cversion="0.2.9">
      <description>Current Sense amplifier (CSACSC) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_CSACSC
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/csacsc.h" attr="config" version="0.2.9"/>
        <file category="source" name="device/tlelib/src/csacsc.c" attr="config" version="0.2.9"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="DMA" condition="cond_TLE988x_9x_DMA" Cversion="0.3.3">
      <description>Direct Memory Access (DMA) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_DMA
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/dma.h" attr="config" version="0.3.3"/>
        <file category="source" name="device/tlelib/src/dma.c" attr="config" version="0.3.3"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="GPIO" condition="cond_TLE988x_9x_GPIO" Cversion="0.2.7">
      <description>General Purpose I/O (GPIO) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_GPIO
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/gpio.h" attr="config" version="0.2.7"/>
        <file category="source" name="device/tlelib/src/gpio.c" attr="config" version="0.2.7"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="GPT12" condition="cond_TLE988x_9x_GPT12" Cversion="0.6.3">
      <description>General Purpose Timer 1/2 (GPT12) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_GPT12
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/gpt12.h" attr="config" version="0.6.3"/>
        <file category="source" name="device/tlelib/src/gpt12.c" attr="config" version="0.6.3"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="INT" condition="cond_TLE988x_9x_INT" Cversion="0.3.3">
      <description>Interrupt (INT) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_INT
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/int.h" attr="config" version="0.3.3"/>
        <file category="source" name="device/tlelib/src/int.c" attr="config" version="0.3.3"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="ISR" condition="cond_TLE988x_9x_ISR" Cversion="0.5.2">
      <description>Interrupt Service Routine (ISR) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_ISR
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/isr.h" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_exceptions.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq0_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq1_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq2_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq3_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq4_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq5_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq7_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq8_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq9_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq10_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq11_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq12_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq13_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq14_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq15_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq16_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq17_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq18_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq19_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq20_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq21_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq22_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq23_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq24_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq25_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq26_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq27_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq28_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq29_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq30_handler.c" attr="config" version="0.5.2"/>
        <file category="source" name="device/tlelib/src/isr_nvic_irq31_handler.c" attr="config" version="0.5.2"/>
      </files>
    </component>
