vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.TLE988x_9x_DFP.pdsc
    <component Cclass="Device" Cgroup="TLELib" Csub="MON" condition="cond_TLE988x_9x_MON" Cversion="0.3.5">
      <description>Monitor Pin (MON) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_MON
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/mon.h" attr="config" version="0.3.5"/>
        <file category="source" name="device/tlelib/src/mon.c" attr="config" version="0.3.5"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="PMU" condition="cond_TLE988x_9x_PMU" Cversion="0.6.1">
      <description>Power Management Unit (PMU) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_PMU
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/pmu.h" attr="config" version="0.6.1"/>
        <file category="source" name="device/tlelib/src/pmu.c" attr="config" version="0.6.1"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="SCU" condition="cond_TLE988x_9x_SCU" Cversion="0.5.6">
      <description>System Control Unit (SCU) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_SCU
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/scu.h" attr="config" version="0.5.6"/>
        <file category="source" name="device/tlelib/src/scu.c" attr="config" version="0.5.6"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="SDADC" condition="cond_TLE988x_9x_SDADC" Cversion="0.4.1">
      <description>Sigma Delta ADC (SDADC) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_SDADC
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/sdadc.h" attr="config" version="0.4.1"/>
        <file category="source" name="device/tlelib/src/sdadc.c" attr="config" version="0.4.1"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="SSC" condition="cond_TLE988x_9x_SSC" Cversion="0.3.9">
      <description>Synchronous Serial Communication (SSC) driver for TLE988x/TLE989xx, for e.g. SPI communication</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_SSC
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/ssc.h" attr="config" version="0.3.9"/>
        <file category="source" name="device/tlelib/src/ssc.c" attr="config" version="0.3.9"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="TIMER2X" condition="cond_TLE988x_9x_TIMER2X" Cversion="0.5.1">
      <description>Timer20, Timer21 (TIMER2X) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_TIMER2X
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/timer2x.h" attr="config" version="0.5.1"/>
        <file category="source" name="device/tlelib/src/timer2x.c" attr="config" version="0.5.1"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="TLELib" Csub="UART" condition="cond_TLE988x_9x_UART" Cversion="0.6.2">
      <description>Universal Asynchronous Receiver Transmitter (UART) driver for TLE988x/TLE989xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_TLELIB_UART
      </RTE_Components_h>
      <files>
        <file category="header" name="device/tlelib/inc/uart.h" attr="config" version="0.6.2"/>
        <file category="source" name="device/tlelib/src/uart.c" attr="config" version="0.6.2"/>
      </files>
    </component>
  </components>
  <examples>
    <example name="TLE9893_2QKW62S_ADC1_POTI_SWTRG" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/ADC1_POTI_SWTRG_EXAMPLE_TLE989X/">
      <description>Reading the Poti voltage via an ADC1 measurement and displaying it on the LEDs</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_ADC1_POTI_SWTRG.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_ADC1_POTI_SWTRG.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_AES_GCM" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/AES_GCM_EXAMPLE_TLE989X/">
      <description>Compute an AES tag and print it via UART</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_AES_GCM.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_AES_GCM.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="UART"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_BL_AND_APP_APPLICATION" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/BL_AND_APP_APPLICATION_EXAMPLE_TLE989X/">
      <description>BL and Application example pair: Application part</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_BL_AND_APP_APPLICATION.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_BL_AND_APP_APPLICATION.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_BL_AND_APP_BOOTLOADER" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/BL_AND_APP_BOOTLOADER_EXAMPLE_TLE989X/">
      <description>BL and Application example pair: Bootloader part</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_BL_AND_APP_BOOTLOADER.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_BL_AND_APP_BOOTLOADER.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_BLINKY_SIMPLE" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/BLINKY_SIMPLE_EXAMPLE_TLE989X/">
      <description>Simple blinking LED</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_BLINKY_SIMPLE.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_BLINKY_SIMPLE.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_CAN_COM" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/CAN_COM_EXAMPLE_TLE989X/">
      <description>The CAN Driver demo is intended to allow evaluation of the CAN driver and its integration.</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_CAN_COM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device Driver" Cgroup="TLELib" Csub="CANCOM"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_CCU7_PWM" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/CCU7_PWM_EXAMPLE_TLE989X/">
      <description>Generating 3 different PWM signals with CCU7</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_CCU7_PWM.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_CCU7_PWM.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CCU7"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_GETTING_STARTED" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/GETTING_STARTED_EXAMPLE_TLE989X/">
      <description>Getting started Project with all components using ULINK2 debugger</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_GETTING_STARTED.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CANCONTR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CANTRX"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CCU7"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="DMA"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPT12"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="MON"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SDADC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="TIMER2X"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="UART"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_MCTRL_HALL" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/MCTRL_HALL_EXAMPLE_TLE989X/">
      <description>Motor Control using Hall Sensors</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_MCTRL_HALL.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_MCTRL_HALL.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CANCONTR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CCU7"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="DMA"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPT12"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="MON"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SDADC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="TIMER2X"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="UART"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_NVM_PROG_UCODE" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/NVM_PROG_UCODE_EXAMPLE_TLE989X/">
      <description>Writing a page to user code flash area</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_NVM_PROG_UCODE.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_NVM_PROG_UCODE.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="TIMER2X"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_NVM_PROG_UDATA" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/NVM_PROG_UDATA_EXAMPLE_TLE989X/">
      <description>Writing a page to user data flash area</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_NVM_PROG_UDATA.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_NVM_PROG_UDATA.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_PMU_SLEEP_EXTRG" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/PMU_SLEEP_EXTRG_EXAMPLE_TLE989X/">
      <description>Entering sleep mode and wakeup via external MON1 trigger</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_PMU_SLEEP_EXTRG.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_PMU_SLEEP_EXTRG.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_PMU_STOP_EXTRG" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/PMU_STOP_EXTRG_EXAMPLE_TLE989X/">
      <description>Entering stop mode and wakeup via external GPIO trigger</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_PMU_STOP_EXTRG.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_PMU_STOP_EXTRG.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_SECURE_BOOT" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/SECURE_BOOT_EXAMPLE_TLE989X/">
      <description>Generate CMAC for secure boot and write it to flash (first page)</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_SECURE_BOOT.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_SECURE_BOOT.ewp"/>
      </project>
