vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Infineon.TLE988x_9x_DFP.pdsc
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="UART"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_SECURITY_ACCESS_USING_AES" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/SECURITY_ACCESS_USING_AES_EXAMPLE_TLE989X/">
      <description>Demonstrate the secure access mechanism using AES</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_SECURITY_ACCESS_USING_AES.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_SECURITY_ACCESS_USING_AES.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="UART"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_SECURITY_ACCESS_USING_CMAC" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/SECURITY_ACCESS_USING_CMAC_EXAMPLE_TLE989X/">
      <description>Demonstrate the secure access mechanism using CMAC</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_SECURITY_ACCESS_USING_CMAC.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_SECURITY_ACCESS_USING_CMAC.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="UART"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_SECURITY_WRITE_KEY" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/SECURITY_WRITE_KEY_EXAMPLE_TLE989X/">
      <description>Write a key to the device based on information sent via UART</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_SECURITY_WRITE_KEY.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_SECURITY_WRITE_KEY.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="UART"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_SSC0_LOOPBACK_SSC1" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/SSC0_LOOPBACK_SSC1_EXAMPLE_TLE989X/">
      <description>Sending magic value via SSC0 and loopback to SSC1 (SPI)</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_SSC0_LOOPBACK_SSC1.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_SSC0_LOOPBACK_SSC1.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SSC"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_T20_PWM_CAPTURE" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/T20_PWM_CAPTURE_EXAMPLE_TLE989X/">
      <description>Capture a PWM signal using T20</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_T20_PWM_CAPTURE.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_T20_PWM_CAPTURE.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="TIMER2X"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_T20_RELOAD_INTTRG" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/T20_RELOAD_INTTRG_EXAMPLE_TLE989X/">
      <description>Blinking a LED via T20</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_T20_RELOAD_INTTRG.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_T20_RELOAD_INTTRG.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="TIMER2X"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_UART_PRINTF" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/UART_PRINTF_EXAMPLE_TLE989X/">
      <description>Using printf to write via UART debug pin</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_UART_PRINTF.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_UART_PRINTF.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="UART"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
    <example name="TLE9893_2QKW62S_UART_TRANSCEIVER" doc="abstract.txt" folder="boards/infineon/tle988x_tle989x_evalboard/UART_TRANSCEIVER_EXAMPLE_TLE989X/">
      <description>Sends and receives data via jlink pins using the uart.</description>
      <board name="TLE988x/TLE989x EvalBoard" vendor="Infineon"/>
      <project>
        <environment name="uv" load="TLE9893_2QKW62S_UART_TRANSCEIVER.uvprojx"/>
        <environment name="iar" load="TLE9893_2QKW62S_UART_TRANSCEIVER.ewp"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC1"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ADC2"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BDRV"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="BOOTROM"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="CSACSC"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="INT"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="ISR"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="PMU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="TLELib" Csub="UART"/>
        <category>Getting Started</category>
        <category>TLELib</category>
      </attributes>
    </example>
  </examples>
</package>
